srmlite/template_srm_get.g2

@@
<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:get soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://tempuri.org/diskCacheV111.srm.server.SRMServerV1">
      <arg0 soapenc:arrayType="xsd:string[1]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <item xsi:type="xsd:string">$${srcSURL}</item>
      </arg0>
      <arg1 soapenc:arrayType="xsd:string[3]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
        <item xsi:type="xsd:string">gsiftp</item>
        <item xsi:type="xsd:string">http</item>
        <item xsi:type="xsd:string">ftp</item>
      </arg1>
    </ns1:get>
  </soapenv:Body>
</soapenv:Envelope>
@@